# Вычислите средние арифметические наборов чисел: а) 2, 4, 7, 8, 9; б) 20, 40, 70, 80, 90; в) 200, 400, 700, 800, 900. 
# a
row = [2, 4, 7, 8, 9]
print(sum(row) / len(row)) # 6
# б 
row = [20, 40, 70, 80, 90]
print(sum(row) / len(row)) # 60
# в 
row = [200, 400, 700, 800, 900]
print(sum(row) / len(row)) # 600

# Числа в пунктах б) и в) получены из чисел в пункте а) умножением на 10 и на 100. 
# Какую закономерность можно наблюдать в поведении средних значений в пунктах б) и в) по сравнению со средним в пункте а)? 
# -- Среднее арифметическое растёт пропорционально множителю в наборах чисел